programs = ["Экономика", "Бизнес-информатика", "Туризм"]
subjects = ["Эконометрика", "Базы данных", "Теория игр",
 "Программирование на Python"]
olympiads = ["Русский медвежонок", "Всероссийская олимпиада «Высшая проба»",
             "Московская олимпиада школьников","Олимпиада школьников «Ломоносов»",
             "Нормы ГТО"]
subject_dict = {"Эконометрика": "наука, изучающая количественные и качественные экономические взаимосвязи с помощью статистических и других математических методов и моделей.",
                "Базы данных": "упорядоченный набор структурированной информации или данных, которые обычно хранятся в электронном виде в компьютерной системе.",
                "Теория игр": " математический метод изучения оптимальных стратегий в играх. ",
                "Программирование на Python": "высокоуровневый язык программирования общего назначения, который используется в том числе и для разработки веб-приложений."
                }

olympiad_dict = {"Русский медвежонок": "самый популярный в стране конкурс школьников по русскому языку. Участвуют в конкурсе все желающие, без какого-либо предварительного отбора. Конкурс проводится в пяти разных возрастных группах: 2 и 3, 4 и 5, 6 и 7, 8 и 9, а также 10 и 11 классы. ",
                "Всероссийская олимпиада «Высшая проба»": "крупнейшее интеллектуальное состязание школьников, которое ежегодно собирает десятки тысяч школьников проверить свои силы и знания. Среди ее особенностей — большой перечень профилей. Победители «Высшей пробы» дополнительно получают 100-процентную скидку по оплате первого года обучения.",
                "Московская олимпиада школьников": " система ежегодных двуэтапных предметных олимпиад для обучающихся в общеобразовательных организациях. Призерство или победа в олимпиаде 1 уровня дает заветное поступление без вступительных испытаний (БВИ) при условии подтверждении баллов на ЕГЭ по профильному предмету. ",
                "Олимпиада школьников «Ломоносов»": "ежегодная олимпиада школьников, проводимая МГУ совместно с другими вузами России. Включена в Перечень олимпиад школьников, что дает право поступления без вступительных испытаний в вузы России.",
                "Нормы ГТО": " это нормативная основа физического воспитания населения страны, нацеленная на развитие массового спорта. Абитуриенты, имеющие золотой, серебряный или бронзовый знак ГТО, могут получить дополнительные баллы к ЕГЭ при поступлении в вуз."
                }